elua/elua/src/platform/lpc24xx/platform.c
  last = ( ( u64 )delay_us * platform_timer_get_clock( id ) ) / 1000000;
  *TxTCR = TMR_ENABLE | TMR_RESET;
  *TxTCR = TMR_ENABLE;
  while( *TxTC < last );
}
      
u32 platform_s_timer_op( unsigned id, int op, u32 data )
{
  u32 res = 0;
  PREG TxTCR = ( PREG )tmr_tcr[ id ];
  PREG TxTC = ( PREG )tmr_tc[ id ];

  switch( op )
  {
    case PLATFORM_TIMER_OP_START:
      *TxTCR = TMR_ENABLE | TMR_RESET;
      *TxTCR = TMR_ENABLE;
      break;
      
    case PLATFORM_TIMER_OP_READ:
      res = *TxTC;
      break;

    case PLATFORM_TIMER_OP_GET_MAX_DELAY:
      res = platform_timer_get_diff_us( id, 0, 0xFFFFFFFF );
      break;
      
    case PLATFORM_TIMER_OP_GET_MIN_DELAY:
      res = platform_timer_get_diff_us( id, 0, 1 );
      break;      
      
    case PLATFORM_TIMER_OP_SET_CLOCK:
      res = platform_timer_set_clock( id, data );
      break;
      
    case PLATFORM_TIMER_OP_GET_CLOCK:
      res = platform_timer_get_clock( id );
      break;
  }
  return res;
}

// ****************************************************************************
// CPU functions

static PREG const posedge_regs[] = { ( PREG )&IO0_INT_EN_R, NULL, ( PREG )&IO2_INT_EN_R };
static PREG const negedge_regs[] = { ( PREG )&IO0_INT_EN_F, NULL, ( PREG )&IO0_INT_EN_F };

// Helper: return the status of a specific interrupt (enabled/disabled)
static int platform_cpuh_get_int_status( elua_int_id id, elua_int_resnum resnum )
{
  int port, pin;
  
  if( id == INT_GPIO_POSEDGE || id == INT_GPIO_NEGEDGE )
  {
    port = PLATFORM_IO_GET_PORT( resnum ); 
    pin = PLATFORM_IO_GET_PIN( resnum ); 
    if( id == INT_GPIO_POSEDGE )
      return *posedge_regs[ port ] & ( 1 << pin );
    else
      return *negedge_regs[ port ] & ( 1 << pin );        
  } 
  return 0;
}

int platform_cpu_set_interrupt( elua_int_id id, elua_int_resnum resnum, int status )
{
  int crt_status = platform_cpuh_get_int_status( id, resnum );
  int port, pin;
  
  if( id == INT_GPIO_POSEDGE || id == INT_GPIO_NEGEDGE )
  {
    port = PLATFORM_IO_GET_PORT( resnum ); 
    pin = PLATFORM_IO_GET_PIN( resnum ); 
    if( id == INT_GPIO_POSEDGE )
    {
      if( status == PLATFORM_CPU_ENABLE )
        *posedge_regs[ port ] |= 1 << pin;
      else
        *posedge_regs[ port ] &= ~( 1 << pin );       
    }
    else
    {
      if( status == PLATFORM_CPU_ENABLE )
        *negedge_regs[ port ] |= 1 << pin;
      else
        *negedge_regs[ port ] &= ~( 1 << pin );         
    }    
  }
  return crt_status;
}

int platform_cpu_get_interrupt( elua_int_id id, elua_int_resnum resnum )
{
  return platform_cpuh_get_int_status( id, resnum );
}

// *****************************************************************************
// ADC specific functions and variables

#ifdef BUILD_ADC

static const u32 adc_trig[] = { 6, 7, 0, 0 };

static const u32 adc_dr[] = { ( u32 )&AD0DR0, ( u32 )&AD0DR1, ( u32 )&AD0DR2, ( u32 )&AD0DR3,
                              ( u32 )&AD0DR4, ( u32 )&AD0DR5, ( u32 )&AD0DR6, ( u32 )&AD0DR7 };

static const u8 pclk_div[] = { 4, 1, 2, 8};

int platform_adc_check_timer_id( unsigned id, unsigned timer_id )
{
  return ( ( timer_id == 1 ) );
}

void platform_adc_stop( unsigned id )
{  
  elua_adc_ch_state *s = adc_get_ch_state( id );
  elua_adc_dev_state *d = adc_get_dev_state( 0 );
    
  s->op_pending = 0;
  INACTIVATE_CHANNEL( d, id );
  
  // If there are no more active channels, stop the sequencer
  if( d->ch_active == 0 && d->running == 1 )
  {
    d->running = 0;
    AD0CR &= 0xF8FFFF00; // stop ADC, disable channels
  }
}



static void adc_int_handler() 
{
  elua_adc_dev_state *d = adc_get_dev_state( 0 );
  elua_adc_ch_state *s = d->ch_state[ d->seq_ctr ];
  u32 tmp, dreg_t;

  tmp = AD0STAT; // Clear interrupt flag
  //AD0INTEN = 0; // Disable generating interrupts

  dreg_t =  *( PREG )adc_dr[ s->id ];
  if ( dreg_t & ( 1UL << 31 ) )
  { 
    d->sample_buf[ d->seq_ctr ] = ( u16 )( ( dreg_t >> 6 ) & 0x3FF );
    AD0CR &= 0xF8FFFF00;	// stop ADC, disable channels
    s->value_fresh = 1;
            
    if ( s->logsmoothlen > 0 && s->smooth_ready == 0)
      adc_smooth_data( s->id );
#if defined( BUF_ENABLE_ADC )
    else if ( s->reqsamples > 1 )
    {
      buf_write( BUF_ID_ADC, s->id, ( t_buf_data* )s->value_ptr );
      s->value_fresh = 0;
    }
#endif
    
    if ( adc_samples_available( s->id ) >= s->reqsamples && s->freerunning == 0 )
    {
      platform_adc_stop( s->id );      
    }
  }

  // Set up for next channel acquisition if we're still running
  if( d->running == 1 )
  {
    // Prep next channel in sequence, if applicable
    if( d->seq_ctr < ( d->seq_len - 1 ) )
      d->seq_ctr++;
    else if( d->seq_ctr == ( d->seq_len - 1 ) )
    { 
      adc_update_dev_sequence( 0 );
      d->seq_ctr = 0; // reset sequence counter if on last sequence entry
    }

    AD0CR |= ( 1ULL << d->ch_state[ d->seq_ctr ]->id );
    //AD0INTEN |= ( 1ULL << d->ch_state[ d->seq_ctr ]->id );
         
    if( d->clocked == 1  && d->seq_ctr == 0 ) // always use clock for first in clocked sequence
    {
      AD0CR |= ( adc_trig[ d->timer_id ] << 24 );
    }

    // Start next conversion if unclocked or if clocked and sequence index > 0
    if( ( d->clocked == 1 && d->seq_ctr > 0 ) || d->clocked == 0 )
    {
      AD0CR |= ( 1ULL << 24 ); // Start conversion now
    }
  }
  VICVectAddr = 0; // ACK interrupt
}

static void platform_setup_adcs()
{
  unsigned id;
  
  for( id = 0; id < NUM_ADC; id ++ )
    adc_init_ch_state( id );

  PCONP |= PCADC;

  AD0CR = ( ( Fpclk / 4500000 - 1 ) << 8 ) |  /* CLKDIV = Fpclk / 1000000 - 1 */   
          ( 0 << 16 ) |     /* BURST = 0, no BURST, software controlled */   
          ( 0 << 17 ) |     /* CLKS = 0, 11 clocks/10 bits */   
          ( 1 << 21 ) |     /* PDN = 1, normal operation */   
          ( 0 << 22 ) |     /* TEST1:0 = 00 */   
          ( 0 << 24 ) |     /* START = 0 A/D conversion stops */   
          ( 0 << 27 );      /* EDGE = 0 (CAP/MAT singal falling,trigger A/D conversion) */ 
  
  // Default enables ADC interrupt only on global, switch to per-channel
  //AD0INTEN &= ~( 1ULL << 8 );
   
  install_irq( ADC0_INT, adc_int_handler, HIGHEST_PRIORITY );
}


// NOTE: On this platform, there is only one ADC, clock settings apply to the whole device
u32 platform_adc_setclock( unsigned id, u32 frequency )
{
  elua_adc_dev_state *d = adc_get_dev_state( 0 );

  if ( frequency > 0 )
  {
    d->clocked = 1;
    
